%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                                   ЗАДАЧА 1                                   %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ГЛАВЕН ПРЕДИКАТ %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% нод_списък(+S, +N, X) - X е списък, който има най-много S на брой елемента, 
%                         всеки от които е четен, положителен и по-малък от 
%                         S, с НОД на елементите равен на N
нод_списък(S, N, X) :- между(0, S, K), генератор_списък(S, K, X), нод(X, N).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ПОМОЩНИ ПРЕДИКАТИ %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% генератор_списък(+S, +K, L) - L е списък с K на брой положителни четни числа, 
%                               всяко от което е по-малко от S
генератор_списък(_, 0, []).
генератор_списък(S, K, [X|L]) :-
    K > 0,
    KMinus1 is K - 1,
    генератор_списък(S, KMinus1, L),
    между(1, S, X),
    X < S,
    0 is X mod 2.

% нод(+X, N) - N е най-големият общ делител на числата в N
нод([Z], Z).
нод([Z|X], N) :- нод(X, K), нод(Z, K, N).

% нод(+A, +B, C) - C е най-големият общ делител на числата A и B
нод(A, 0, A).
нод(A, B, C) :- B \= 0, R is A mod B, нод(B, R, C).

% между(+Lo, +Hi, X) - естественото число X е между естествените числа Lo и Hi
между(Lo, Hi, Lo) :- Lo =< Hi.
между(Lo, Hi, X) :- Lo < Hi, LoPlus1 is Lo + 1, между(LoPlus1, Hi, X).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                                   ЗАДАЧА 2                                   %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ГЛАВЕН ПРЕДИКАТ %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% оцветяване(+G, +N) - съществува оцветяване на G с N на брой цвята, за което 
%                      никои два разноцветни върха не са свързани с ребро
оцветяване([V, E], N) :-
    разбиване(V, N, ColorSplit),
    not(( елемент(C1, ColorSplit),
          елемент(C2, ColorSplit),
          C1 \= C2,
          елемент(U1, C1),
          елемент(U2, C2),
          елемент([U1, U2], E) )).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% ПОМОЩНИ ПРЕДИКАТИ %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% разбиване(+L, +N, P) - P е разбиване на L на N непразни списъци
разбиване(L, N, P) :- пермутация(L, L1), разделяне(L1, N, P).

% пермутация(+L, P) - P се получава чрез разбъркване на елементите на списъка L
пермутация([], []).
пермутация([X|L], P) :-
    пермутация(L, PL),
    конкат(PL1, PL2, PL),
    конкат(PL1, [X|PL2], P).

% разделяне(+L, +N, P) - P е последователно разбиване на L на N непразни списъци
разделяне(L, 1, [L]) :- L = [_|_].
разделяне(L, N, [X|P]) :-
    N > 1,
    NMinus1 is N - 1,
    конкат(X, L1, L),
    X \= [],
    разделяне(L1, NMinus1, P).

% конкат(L, M, +K) - списъкът K се получава като конкатенираме списъците L и M
конкат([], M, M).
конкат([X|L], M, [X|K]) :- конкат(L, M, K).

% елемент(X, +L) - X е елемент на списъка L
елемент(X, [X|_]).
елемент(X, [_|L]) :- елемент(X, L).
